<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\User;
use App\Models\Course;
use Illuminate\Support\Str;
use Spatie\Permission\Models\Role;


class CourseSeeder extends Seeder
{
    public function run(): void
    {
        $teachers = [];

        $getTeacher = function ($name) use ($teachers) {

            if (!isset($teachers[$name])) {
                $user = User::firstOrCreate(
                    ['name' => $name],
                    [
                        'password' => bcrypt('password'),
                        'email' => Str::slug($name, '.') . '@example.com'
                    ]
                );

                $user->assignRole('teacher');

                $teachers[$name] = $user;
            }

            return $teachers[$name];
        };


        $courses = [

            ['وسائط متعددة 2 نظري', ['نجوى']],
            ['وسائط متعددة 2 عملي', ['نجوى']],
            ['نظم التشغيل عملي', ['نسرين']],
            ['تقانات الانترنت عملي', ['نسرين']],
            ['تقانات الانترنت نظري', ['نجوى']],
            ['امن معلومات نظري', ['مها']],
            ['امن معلومات عملي', ['مها']],
            ['مخدمات ويب نظري', ['نوران']],
            ['مخدمات ويب عملي', ['نوران']],
            ['بنية تجهيزات', ['ياسمين اسعد']],
            ['أسس اتصالات', ['اميرة دويك']],
            ['إدارة', ['لينا هارون']],
            ['لغة', ['شادي درويش']],
            ['رياضيات', ['رهف ابو عريضة']],
            [' تصميم 1 نظري', ['نور كنعان']],
            ['تصميم 1 عملي', ['ميرنا استانبولية']],
            ['مخدمات نظري', ['ياسمين اسعد']],
            ['نظم تشغيل شبكية 2', ['هشام سبحان']],
            ['حماية', ['هشام سبحان']],
            ['امن نظري', ['ميرنا استانبولية']],
            ['امن عملي', ['ميرنا استانبولية']],
            ['اتصالات حديثة نظري', ['نور كنعان']],
            ['اتصالات حديثة عملي', ['نور كنعان']],
            ['تقانات الانترنت عملي (2)', ['هديل عجم']],
            ['تقانات الانترنت نظري (2)', ['هديل عجم']],
            ['صيانة نظري', ['مهند']],
            ['برمجة', ['نوران']],
            ['مهارات عملي', ['لينا']],
            ['رياضيات 2', ['آيات']],
            ['صيانة عملي', ['آية']],
            ['مهارات نظري', ['نجوى']],
            ['تصميم مواقع', ['منال']],
            ['لغة 2', ['سلاف']],
            ['بروتوكولات', ['اسماء']],
            ['برمجة متقدمة', ['ياسمين اسعد']],
            ['صيانة حاسوب', ['ياسمين اسعد']],
            ['لغة 3', ['سلاف طرابيشي']],
            ['مهارات حاسوبية', ['لينا هرون']],
            ['عربي', ['اسراء قمري']],
            ['نظم تشغيل', ['اميرة دويك']],
            ['لغة 4', ['شادي']],
            ['تركيب شبكات', ['نور كنعان']],
            ['شبكات واسعة', ['نور كنعان']],
            ['تصميم شبكات', ['ميرنا استانبولية']],
            ['رياضيات 3', ['رهف ابو عريضة']],
            ['صيانة', ['رنيم']],
            ['برمجة متقدمة عملي', ['اسماء', 'اميرة']],
            ['مهارات', ['سلوى']],
            ['رياضيات 4', ['آيات']],
            ['لغة 5', ['سلاف', 'دانا']],
            ['بنية حاسوبية', ['اميرة']],
            ['برمجة متقدمة نظري', ['عفراء']],
            ['ربط حاسوبي نظري', ['عفراء']],
            ['ربط حاسوبي عملي', ['عفراء']],
            ['PLC', ['ميسة']],
            ['صيانة تجهيزات مكتبية', ['هشام']],
            ['لغة 6', ['شادي']],
            ['رياضيات 5', ['رهف']],
        ];

        foreach ($courses as [$name, $teacherNames]) {

            $teacher = $getTeacher($teacherNames[0]);

            Course::firstOrCreate(
                ['name' => trim($name)],
                ['teacher_id' => $teacher->id]
            );
        }
    }
}
